#include "Boss.h"
#include "DxLib.h"
#include <cmath>

//============================================================
// コンストラクタ（ボスの初期化）
//============================================================
Boss::Boss()
{
	// 初期位置設定
	x = 200;
	y = 50;

	// 体力設定
	hp = 2000;

	// 生存状態
	isDead = false;
	
	// 移動用タイマー
	t = 0;
}

//============================================================
// ボスの更新処理
//============================================================
void Boss::Update()
{
	// 毎フレームタイマーを増やす
	t++;

	// sinをつかってボスを左右に移動
	x = 200 + static_cast<int>(sin(t * 0.05) * 100);
	
}

//============================================================
// ボスの描画処理
//============================================================
void Boss::Draw(int Image)
{
	// 指定された画像を描画
	DrawGraph(x, y, Image, TRUE);
}
