#include "Bullet.h"
#include "DxLib.h"

//============================================================
// コンストラクタ（弾の初期化）
//============================================================
Bullet::Bullet(int startX, int startY, float vx, float vy)
{
	// 初期位置設定
	x = startX;
	y = startY;

	this->vx = vx;
	this->vy = vy;

	// ダメ―ジを設定
	damage = 100;

	// 生存状態
	isDead = false;
}

//============================================================
// 弾の更新処理
//============================================================
void Bullet::Update()
{

	x += vx;
	y += vy;

	// 画面外に出たら削除
	if (y < 0 || y > 1024 || x < 0 || x > 1536)
	{
		isDead = true;
	}
}

//============================================================
// 弾の描画処理
//============================================================
void Bullet::Draw(int Image)
{
	// 指定された画像を描画
	DrawGraph(x, y, Image, TRUE);
}
