#include "Bullet.h"
#include "DxLib.h"

//============================================================
// コンストラクタ（弾の初期化）
//============================================================
Bullet::Bullet(int startX, int startY, float vx, float vy,int image, int damage)
{
	// 初期位置設定
	x = startX;
	y = startY;

	// X方向・Y方向の移動速度を設定
	this->vx = vx;
	this->vy = vy;

	this->image = image;
	this->damage = damage;
	// 生存状態
	isDead = false;
}

//============================================================
// 弾の更新処理
//============================================================
void Bullet::Update()
{

	x += vx;
	y += vy;

	// 画面外に出たら削除
	if (y < 0 || y > 1024 || x < 0 || x > 1536)
	{
		isDead = true;
	}
}

//============================================================
// 弾の描画処理
//============================================================
void Bullet::Draw()
{
	// 指定された画像を描画
	DrawGraph(x, y, image, TRUE);
}
