#include "Effect.h"
#include "DxLib.h"

//============================================================
// コンストラクタ（敵の初期化）
//============================================================
Effect::Effect(int x, int y ,int image)
{
	// 表示位置設定
	this->x = x;
	this->y = y;

	// 使用する画像
	this->image = image;

	// 表示時間
	timer = 10;

	// 削除フラグ
	isDead = false;	
}

//============================================================
// エフェクトの更新処理
//============================================================
void Effect::Update()
{
	// タイマーを減らす
	timer--;

	// タイマーが0になったら削除
	if (timer <= 0)
	{
		isDead = true;
	}
}

//============================================================
// エフェクトの描画処理
//============================================================
void Effect::Draw()
{
	// 画像サイズ取得
	int w, h;
	GetGraphSize(image, &w, &h);

	// 画像の中心を基準に描画
	DrawGraph(x - w / 2, y - h / 2, image, TRUE);
}
