#include "Bullet.h"
#include "GameScene.h"
#include "DxLib.h"

//============================================================
// コンストラクタ（弾の初期化）
//============================================================
Bullet::Bullet(int startX, int startY)
{
	// 初期位置設定
	x = startX;
	y = startY;

	// ダメ―ジを設定
	damage = 100;

	// 生存状態
	isDead = false;
}

//============================================================
// 弾の更新処理
//============================================================
void Bullet::Update()
{
	// 上に移動
	y -= 10;

	// 画面外に出たら削除
	if (y < 0)
	{
		isDead = true;
	}
}

//============================================================
// 弾の描画処理
//============================================================
void Bullet::Draw(int Image)
{
	// 指定された画像を描画
	DrawGraph(x, y, Image, TRUE);
}
